Revit 2024 API
BuiltInFailures.DimensionFailures.LockOverconstrainedAlignment Property
 Locking this alignment would overconstrain the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LockOverconstrainedAlignment { get; }
Visual Basic
Public Shared ReadOnly Property LockOverconstrainedAlignment As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LockOverconstrainedAlignment {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace